'use strict';

//1
// Boolean(Number('10')) + 1;
// код поверне число 2, тому що (Number('10') - це число 10, Boolean(10)) - це true, а true - це 1, відповідно 1+1=2


// //2
// 'sub' + Number(false);
// код поверне рядок sub0, оскільки відбувається конкатинація рядка sub та числа 0


// //3
// 16  *  '      91    '
// код поверне число 1456, оскільки відбувається математична дія множення


// //4
// true-70
// код поверне число -69, оскільки відбувається математична дія віднімання 1-70=-69


// //5
// Number(1 + String(1)) + 1
// код поверне число 12, String(1) дає нам рядок 1 і відбудеться конкатинація з результатом рядок 11,
// далі функція Number перетворить рядок на число 11, далі математична дія додавання 11+1=12